{
  "_name_or_path": "google/mobilebert-uncased",
  "architectures": [
    "MobileBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "I-BOD",
    "1": "I-BUILDING",
    "2": "I-CARDISSUER",
    "3": "I-CITY",
    "4": "I-COUNTRY",
    "5": "I-DATE",
    "6": "I-DRIVERLICENSE",
    "7": "I-EMAIL",
    "8": "I-GEOCOORD",
    "9": "I-GIVENNAME1",
    "10": "I-GIVENNAME2",
    "11": "I-IDCARD",
    "12": "I-IP",
    "13": "I-LASTNAME1",
    "14": "I-LASTNAME2",
    "15": "I-LASTNAME3",
    "16": "I-PASS",
    "17": "I-PASSPORT",
    "18": "I-POSTCODE",
    "19": "I-SECADDRESS",
    "20": "I-SEX",
    "21": "I-SOCIALNUMBER",
    "22": "I-STATE",
    "23": "I-STREET",
    "24": "I-TEL",
    "25": "I-TIME",
    "26": "I-TITLE",
    "27": "I-USERNAME",
    "28": "B-BOD",
    "29": "B-BUILDING",
    "30": "B-CARDISSUER",
    "31": "B-CITY",
    "32": "B-COUNTRY",
    "33": "B-DATE",
    "34": "B-DRIVERLICENSE",
    "35": "B-EMAIL",
    "36": "B-GEOCOORD",
    "37": "B-GIVENNAME1",
    "38": "B-GIVENNAME2",
    "39": "B-IDCARD",
    "40": "B-IP",
    "41": "B-LASTNAME1",
    "42": "B-LASTNAME2",
    "43": "B-LASTNAME3",
    "44": "B-PASS",
    "45": "B-PASSPORT",
    "46": "B-POSTCODE",
    "47": "B-SECADDRESS",
    "48": "B-SEX",
    "49": "B-SOCIALNUMBER",
    "50": "B-STATE",
    "51": "B-STREET",
    "52": "B-TEL",
    "53": "B-TIME",
    "54": "B-TITLE",
    "55": "B-USERNAME",
    "56": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_31": 31,
    "LABEL_32": 32,
    "LABEL_33": 33,
    "LABEL_34": 34,
    "LABEL_35": 35,
    "LABEL_36": 36,
    "LABEL_37": 37,
    "LABEL_38": 38,
    "LABEL_39": 39,
    "LABEL_4": 4,
    "LABEL_40": 40,
    "LABEL_41": 41,
    "LABEL_42": 42,
    "LABEL_43": 43,
    "LABEL_44": 44,
    "LABEL_45": 45,
    "LABEL_46": 46,
    "LABEL_47": 47,
    "LABEL_48": 48,
    "LABEL_49": 49,
    "LABEL_5": 5,
    "LABEL_50": 50,
    "LABEL_51": 51,
    "LABEL_52": 52,
    "LABEL_53": 53,
    "LABEL_54": 54,
    "LABEL_55": 55,
    "LABEL_56": 56,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "vocab_size": 30522
}
